# NoElementSelected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SelectionFailures..::..NoElementSelected Property
BuiltInFailures..::..SelectionFailures Class See Also
---
No element selected.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoElementSelected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoElementSelected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoElementSelected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SelectionFailures Class
Autodesk.Revit.DB Namespace